<?php
return [
  // شريط التنقل
  'HomePage Link' => 'الرئيسية',
  'CategoriesPage Link' => 'الفئات',
  'AboutUsPage Link' => 'عنا',
  'ContactPage Link' => 'تواصل معنا',
  // قسم البطل
  'Hero Title' => 'محمية الصبار',
  'Hero Paragraph' => 'اكتشف قوة الصبار المستدام. بدءًا من الزراعة وحتى التسليم العالمي، نقدم لك مستخلصات متميزة.',
  'Hero Main Button' => 'تسوق الآن',

  // قسم الدعوة إلى العمل (CTA)
  'CTA Section Title' => 'الصبار لبشرتك وشعرك وصحتك',
  'CTA Section item1 text' => 'يساعد الصبار على تهدئة البشرة وترطيبها وتجديدها، مما يساعد في علاج حروق الشمس وحب الشباب والتهيج.',
  'CTA Section item2 text' => 'يغذي فروة الرأس، ويقلل من قشرة الرأس، ويعزز لمعان الشعر وصحته.',
  'CTA Section item3 text' => 'يساعد الصبار على الهضم، ويعزز المناعة، ويزيل السموم من الجسم.',

  // قسم الفءات
  'Categories Section Title' => 'الفئات',
  'Categories Section category1 text' => 'مزارعو الصبار',
  'Categories Section category2 text' => 'شراء أوراق الصبار',
  'Categories Section category3 text' => 'شراء مستخلص الصبار',
  'Categories Section category4 text' => 'فوائد الصبار',
  'Explore button' => 'اكتشف المزيد',

  'aboutUs' => [
    'title' => 'من نحن',
    'text' => 'من كلية العلوم بجامعة بني سويف',
    'heading1' => 'نحن ,فريق الألوفيرا',
    'text1' => 'نحن مؤهلون لمسابقة Bio-iChallenge 2024 وتحديدا في التحدي الخامس الذي تنظمه شركة جوفياليتي، مشروعنا ممول من صندوق دعم المبدعين المصريين.',
    'heading2' => 'اعضاء الفريق',
    'text2' => 'فريقنا عبارة عن مجموعة متنوعة من الأفراد الموهوبين الملتزمين بالتعاون والابتكار. معًا، نسعى جاهدين لتحقيق التميز في كل مشروع',
    'academic_supervisor_title' => 'المشرف الأكاديمي',
    'industrial_supervisor_title' => 'المشرفة الصناعية',
    'industrial_supervisor' => 'د. آية سعيد',
    'academic_supervisor' => 'د. وائل أحمد فتحي',
    'member1' => 'نورهان ضياء سعد',
    'member2' => 'نهيل سالم أبو زيد',
    'member3' => 'منار أبو المجد ياسين',
    'member4' => 'إيمان أشرف محمد',
  ],
  'contactUs' => [
    'title' => 'Contact Us',
    'heading' => 'ابقي علي تواصل',
    'text' => ' نحن هنا للإجابة على أي أسئلة قد تكون لديك حول منتجاتنا. تواصل معنا وسنرد عليك في أقرب وقت ممكن. ',
    'name_placeholder' => 'اكتب اسمك',
    'email_placeholder' => ' اكتب بريدك الإلكتروني',
    'message_placeholder' => ' تفضل، نحن نستمع...',
    'send_value' => ' إرسال',
  ],
  'aloe_vera_farmers' => [
    'heading' => 'مزارعو الصبار',
    'paragraph' => '"أيها المزارعون، اعرضوا صباركم بفعالية! قدموا الكميات التفصيلية والأسعار التنافسية والمواصفات الواضحة لتسويق صباركم بذكاء وجذب أفضل المشترين."',
    'not_allowed' => [
      'title' => 'مرحباً، مزارع',
      'text' => 'سجل دخولك إلى حسابك للوصول إلى خدماتنا أو أنشئ حساباً جديداً.'
    ],
  ],
  'farmer_form' =>
  [
    'heading' => ' املأ النموذج',
    'product_title' => 'عنوان المنتج',
    'product_title_placeholder' => 'أدخل عنوان المنتج',
    'cactus_type' => 'نوع الصبار',
    'select_type' => 'اختر النوع',
    'type1' => 'طبي',
    'type2' => 'صناعي',
    'type3' => 'زينة',
    'available_quantity' => 'الكمية المتاحة',
    'available_quantity_placeholder' => 'أدخل الكمية',
    'weight' => 'الوزن أو عدد وحدات الصبار',
    'price' => 'Price',
    'price_per' => 'السعر لكل كيلوغرام أو وحدة',
    'price_placeholder' => 'أدخل السعر',
    'additional_details' => 'تفاصيل إضافية (اختياري)',
    'additional_details_placeholder' => 'أدخل التفاصيل الإضافية',
    'upload_image' => 'تحميل الصور',
    'submit' => 'إرسال',
  ],
  'buy_leaves' => [
    'heading' => 'اشترِ أوراق الصبار',
    'paragraph' => '" اكتشف مستخلص الصبار عالي الجودة الذي تم تصنيعه بعناية لتلبية احتياجاتك. سواء للاستخدام التجاري أو الشخصي، استكشف تجربة تسوق سلسة مع خيارات كمية مرنة لتناسب متطلباتك.
  "',
    'filters' => [
      'filter1' => 'الكل',
      'filter2' => 'طبي',
      'filter3' => 'زينة',
      'filter4' => 'صناعي',
    ],
    'farmers_products' => 'منتجات المزارعين',
  ],
  'buy_extract' => [
    'heading' => 'اشترِ مستخلص الصبار',
    'paragraphs' => '   "اكتشف مستخلص  الصبار الفاخر لدينا، المثالي للاستخدام التجاري والشخصي. تصفح وحدد الكمية التي تناسب احتياجاتك، واستمتع بفوائد هذا المنتج الطبيعي عالي الجودة للعناية بالبشرة والصحة والمزيد." ',
    'explore' => ' اكتشف المنتجات',
    'products_section' => [
      'title' => 'منتجاتنا',
      'quantity' => 'الكمية',
      'add_to_cart' => 'أضف إلى السلة',
    ]
  ],
  'benefit_section' => [
    'title' => 'اكتشف روائع الصبار',
    'lead' => 'تعرّف على فوائدها المذهلة لبشرتك وصحتك والمزيد.',
    'aloe-vera' => [
      'title' => 'ما هي الصبار؟',
      'text' => 'الصبار هي نوع من النباتات العصارية المعروفة بخصائصها الطبية. تم استخدامها لقرون في الطب التقليدي ومنتجات العناية بالبشرة والصحة. تحتوي مادتها الهلامية على الفيتامينات والإنزيمات والمعادن التي تعزز الشفاء والترطيب.',
    ],
    'benefits' => [
      'title' => 'فوائد الصبار',
      'benefit1' => [
        'title' => 'العناية بالبشرة',
        'text' => 'الصبار مرطب طبيعي، يهدئ البشرة الجافة ويقلل من حب الشباب أو التهيج.',
      ],
      'benefit2' => [
        'title' => 'يدعم الهضم',
        'text' => 'يمكن أن يساعد عصير الصبار في تحسين الهضم وتقليل الانتفاخ أو الإمساك.',
      ],
      'benefit3' => [
        'title' => 'خصائص الشفاء',
        'text' => 'يُعرف الهلام النباتي بخصائصه في شفاء الجروح ومكافحة الالتهابات.',
      ],
    ],
    'gallery' => [
      'title' => 'الصبار في التطبيق',
    ],
  ],

  // تسجيل الدخول والتسجيل
  'login' => [
    'title' => 'مرحبًا بعودتك',
    'email' => 'البريد الإلكتروني',
    'email_placeholder' => 'أدخل البريد الإلكتروني',
    'password' => 'كلمة المرور',
    'password_placeholder' => 'أدخل كلمة المرور',
    'remember' => 'تذكرني',
    'login' => 'تسجيل الدخول',
    'create_new_user' => ' انشاء حساب جديد',
    'logout' => 'تسجيل الخروج',
  ],
  'register' => [
    'title' => 'قم إنشاء حساب والانضمام إلينا',
    'full_name' => 'الاسم الكامل',
    'full_name_placeholder' => 'أدخل الاسم الكامل',
    'username' => 'اسم المستخدم',
    'username_placeholder' => 'أدخل اسم المستخدم',
    'email' => 'البريد الإلكتروني',
    'email_placeholder' => 'أدخل البريد الإلكتروني',
    'phone_number' => 'رقم الهاتف',
    'phone_number_placeholder' => 'أدخل رقم الهاتف',
    'address' => 'العنوان',
    'address_placeholder' => 'أدخل العنوان',
    'password' => 'كلمة المرور',
    'password_placeholder' => 'أدخل كلمة المرور',
    'confirm_password' => 'تأكيد كلمة المرور',
    'confirm_password_placeholder' => 'أدخل كلمة المرور',
    'register' => 'تسجيل',
    'have_account' => 'لديك حساب؟',
  ],
  'validation' => [
    'require' => 'مطلوب ولا يمكن أن يكون فارغًا'
  ],

];
